In [4]:
import pandas as pd
import numpy as np
df=pd.DataFrame({"Name":['satya','siri','priya','haritha'],
                "age":[np.nan,20,19,18],
                "place":['vzg','vjwd','sklm','nuz']})
df

      Name   age place
0    satya   NaN   vzg
1     siri  20.0  vjwd
2    priya  19.0  sklm
3  haritha  18.0   nuz

In [5]:
df.dropna()

      Name   age place
1     siri  20.0  vjwd
2    priya  19.0  sklm
3  haritha  18.0   nuz

In [6]:
df.dropna(axis='columns')

      Name place
0    satya   vzg
1     siri  vjwd
2    priya  sklm
3  haritha   nuz

In [7]:
df.dropna(thresh=3)

      Name   age place
1     siri  20.0  vjwd
2    priya  19.0  sklm
3  haritha  18.0   nuz

In [8]:
df.dropna(subset=['age'])

      Name   age place
1     siri  20.0  vjwd
2    priya  19.0  sklm
3  haritha  18.0   nuz

In [9]:
df.dropna(inplace=True)
df

      Name   age place
1     siri  20.0  vjwd
2    priya  19.0  sklm
3  haritha  18.0   nuz

In [10]:
txt="Two days Two Nights,one week,two months,three times,two thousand,fifty minutes"
x=txt.replace("two","five")
print(x)

Two days Two Nights,one week,five months,three times,five thousand,fifty minutes

In [11]:
import pandas as pd
import numpy as np
dff=pd.DataFrame({'num':np.random.randint(1,50,15)})
dff['bins']=pd.cut(x=dff['num'],bins=[1,12,19,28])
print(dff)
print(dff['bins'].unique())

    num          bins
0    27  (19.0, 28.0]
1    28  (19.0, 28.0]
2    18  (12.0, 19.0]
3    20  (19.0, 28.0]
4    35           NaN
5     6   (1.0, 12.0]
6    47           NaN
7    23  (19.0, 28.0]
8    23  (19.0, 28.0]
9    37           NaN
10   12   (1.0, 12.0]
11   10   (1.0, 12.0]
12   40           NaN
13    4   (1.0, 12.0]
14   20  (19.0, 28.0]
[(19.0, 28.0], (12.0, 19.0], NaN, (1.0, 12.0]]
Categories (3, interval[int64, right]): [(1, 12] < (12, 19] < (19, 28]]